## 📋 Plan Preview — `prod`

✅ **Sem mudanças** — infraestrutura já está no estado desejado.

<details><summary>Ver plan completo</summary>

```hcl
module.eks.data.aws_region.current: Reading...
module.ecr_targeting_service.data.aws_caller_identity.current: Reading...
module.ecr_evaluation_service.data.aws_caller_identity.current: Reading...
module.ecr_flag_service.data.aws_caller_identity.current: Reading...
module.redis.data.aws_region.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.redis.data.aws_caller_identity.current: Reading...
module.ecr_analytics_service.data.aws_caller_identity.current: Reading...
data.aws_iam_role.lab_role: Reading...
module.redis.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.eks.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecr_targeting_service.data.aws_region.current: Reading...
module.ecr_targeting_service.data.aws_partition.current: Reading...
module.sqs_events.data.aws_caller_identity.current: Reading...
module.ecr_targeting_service.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr_targeting_service.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecr_evaluation_service.data.aws_partition.current: Reading...
module.rds_flag_service.data.aws_partition.current: Reading...
module.ecr_evaluation_service.data.aws_partition.current: Read complete after 0s [id=aws]
module.rds_flag_service.data.aws_partition.current: Read complete after 0s [id=aws]
module.rds_auth_service.data.aws_partition.current: Reading...
module.ecr_auth_service.data.aws_caller_identity.current: Reading...
module.rds_auth_service.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr_auth_service.data.aws_partition.current: Reading...
module.ecr_auth_service.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr_evaluation_service.data.aws_region.current: Reading...
module.ecr_evaluation_service.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.rds_targeting_service.data.aws_partition.current: Reading...
module.rds_targeting_service.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr_analytics_service.data.aws_region.current: Reading...
module.ecr_analytics_service.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecr_auth_service.data.aws_region.current: Reading...
module.ecr_auth_service.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecr_analytics_service.data.aws_partition.current: Reading...
module.ecr_analytics_service.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr_flag_service.data.aws_partition.current: Reading...
module.ecr_flag_service.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr_flag_service.data.aws_region.current: Reading...
module.ecr_flag_service.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.dynamodb_analytics.data.aws_region.current: Reading...
module.dynamodb_analytics.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.dynamodb_analytics.data.aws_caller_identity.current: Reading...
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=852826843210]
module.sqs_events.data.aws_region.current: Reading...
module.sqs_events.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_availability_zones.available: Reading...
module.ecr_targeting_service.data.aws_caller_identity.current: Read complete after 0s [id=852826843210]
module.ecr_targeting_service.data.aws_iam_policy_document.ecr_kms_key_policy: Reading...
module.ecr_targeting_service.data.aws_iam_policy_document.ecr_kms_key_policy: Read complete after 0s [id=34267956]
module.ecr_flag_service.data.aws_caller_identity.current: Read complete after 0s [id=852826843210]
module.ecr_flag_service.data.aws_iam_policy_document.ecr_kms_key_policy: Reading...
module.ecr_flag_service.data.aws_iam_policy_document.ecr_kms_key_policy: Read complete after 0s [id=34267956]
module.ecr_analytics_service.data.aws_caller_identity.current: Read complete after 1s [id=852826843210]
module.ecr_analytics_service.data.aws_iam_policy_document.ecr_kms_key_policy: Reading...
module.ecr_analytics_service.data.aws_iam_policy_document.ecr_kms_key_policy: Read complete after 0s [id=34267956]
module.ecr_evaluation_service.data.aws_caller_identity.current: Read complete after 1s [id=852826843210]
module.ecr_evaluation_service.data.aws_iam_policy_document.ecr_kms_key_policy: Reading...
module.sqs_events.data.aws_caller_identity.current: Read complete after 1s [id=852826843210]
module.ecr_evaluation_service.data.aws_iam_policy_document.ecr_kms_key_policy: Read complete after 0s [id=34267956]
module.ecr_auth_service.data.aws_caller_identity.current: Read complete after 1s [id=852826843210]
module.sqs_events.data.aws_iam_policy_document.kms: Reading...
module.ecr_auth_service.data.aws_iam_policy_document.ecr_kms_key_policy: Reading...
module.redis.data.aws_caller_identity.current: Read complete after 1s [id=852826843210]
module.sqs_events.data.aws_iam_policy_document.kms: Read complete after 0s [id=686476663]
module.dynamodb_analytics.data.aws_caller_identity.current: Read complete after 1s [id=852826843210]
module.ecr_auth_service.data.aws_iam_policy_document.ecr_kms_key_policy: Read complete after 0s [id=34267956]
module.redis.data.aws_iam_policy_document.elasticache_kms: Reading...
module.redis.data.aws_iam_policy_document.elasticache_kms: Read complete after 0s [id=224752399]
module.dynamodb_analytics.data.aws_iam_policy_document.kms: Reading...
module.dynamodb_analytics.data.aws_iam_policy_document.kms: Read complete after 0s [id=2717720102]
data.aws_iam_role.lab_role: Read complete after 1s [id=LabRole]
module.vpc.data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_security_group.eks_workers will be created
  + resource "aws_security_group" "eks_workers" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS worker nodes"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "eks-ToggleMaster-prd-workers"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_vpc_security_group_egress_rule.eks_workers_egress_all will be created
  + resource "aws_vpc_security_group_egress_rule" "eks_workers_egress_all" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # aws_vpc_security_group_ingress_rule.eks_workers_from_pritunl will be created
  + resource "aws_vpc_security_group_ingress_rule" "eks_workers_from_pritunl" {
      + arn                          = (known after apply)
      + description                  = "All traffic from Pritunl VPN"
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # aws_vpc_security_group_ingress_rule.eks_workers_from_self will be created
  + resource "aws_vpc_security_group_ingress_rule" "eks_workers_from_self" {
      + arn                          = (known after apply)
      + description                  = "All traffic from self (EKS workers)"
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # aws_vpc_security_group_ingress_rule.eks_workers_from_vpc_cidr will be created
  + resource "aws_vpc_security_group_ingress_rule" "eks_workers_from_vpc_cidr" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/20"
      + description            = "All traffic from VPC CIDR"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # module.dynamodb_analytics.aws_cloudwatch_metric_alarm.read_throttle_events[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "read_throttle_events" {
      + actions_enabled                       = true
      + alarm_description                     = "Triggered when read throttle events exceed threshold for ToggleMasterAnalytics"
      + alarm_name                            = "ToggleMasterAnalytics-read-throttle-events"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "TableName" = "ToggleMasterAnalytics"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "ReadThrottleEvents"
      + namespace                             = "AWS/DynamoDB"
      + period                                = 300
      + region                                = "us-east-1"
      + statistic                             = "Sum"
      + tags                                  = {
          + "Ambiente"    = "terraform-prod"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "terraform-aws-dynamodb"
        }
      + tags_all                              = {
          + "Ambiente"    = "terraform-prod"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "terraform-aws-dynamodb"
        }
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }

  # module.dynamodb_analytics.aws_cloudwatch_metric_alarm.user_errors[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "user_errors" {
      + actions_enabled                       = true
      + alarm_description                     = "Triggered when user errors exceed threshold for ToggleMasterAnalytics"
      + alarm_name                            = "ToggleMasterAnalytics-user-errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "TableName" = "ToggleMasterAnalytics"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "UserErrors"
      + namespace                             = "AWS/DynamoDB"
      + period                                = 300
      + region                                = "us-east-1"
      + statistic                             = "Sum"
      + tags                                  = {
          + "Ambiente"    = "terraform-prod"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "terraform-aws-dynamodb"
        }
      + tags_all                              = {
          + "Ambiente"    = "terraform-prod"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "terraform-aws-dynamodb"
        }
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }

  # module.dynamodb_analytics.aws_cloudwatch_metric_alarm.write_throttle_events[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "write_throttle_events" {
      + actions_enabled                       = true
      + alarm_description                     = "Triggered when write throttle events exceed threshold for ToggleMasterAnalytics"
      + alarm_name                            = "ToggleMasterAnalytics-write-throttle-events"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "TableName" = "ToggleMasterAnalytics"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "WriteThrottleEvents"
      + namespace                             = "AWS/DynamoDB"
      + period                                = 300
      + region                                = "us-east-1"
      + statistic                             = "Sum"
      + tags                                  = {
          + "Ambiente"    = "terraform-prod"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "terraform-aws-dynamodb"
        }
      + tags_all                              = {
          + "Ambiente"    = "terraform-prod"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "terraform-aws-dynamodb"
        }
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }

  # module.dynamodb_analytics.aws_dynamodb_contributor_insights.this[0] will be created
  + resource "aws_dynamodb_contributor_insights" "this" {
      + id         = (known after apply)
      + mode       = (known after apply)
      + region     = "us-east-1"
      + table_name = "ToggleMasterAnalytics"
    }

  # module.dynamodb_analytics.aws_dynamodb_table.this will be created
  + resource "aws_dynamodb_table" "this" {
      + arn                         = (known after apply)
      + billing_mode                = "PAY_PER_REQUEST"
      + deletion_protection_enabled = false
      + hash_key                    = "event_id"
      + id                          = (known after apply)
      + name                        = "ToggleMasterAnalytics"
      + read_capacity               = (known after apply)
      + region                      = "us-east-1"
      + stream_arn                  = (known after apply)
      + stream_enabled              = false
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      + tags                        = {
          + "Ambiente"    = "terraform-prod"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "terraform-aws-dynamodb"
          + "Name"        = "ToggleMasterAnalytics"
        }
      + tags_all                    = {
          + "Ambiente"    = "terraform-prod"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "terraform-aws-dynamodb"
          + "Name"        = "ToggleMasterAnalytics"
        }
      + write_capacity              = (known after apply)

      + attribute {
          + name = "event_id"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.ecr_analytics_service.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire untagged images older than 3 days"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 3
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep only last 10 tagged images"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "prod",
                              + "staging",
                              + "dev",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + region      = "us-east-1"
      + registry_id = (known after apply)
      + repository  = "togglemaster/analytics-service"
    }

  # module.ecr_analytics_service.aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "togglemaster/analytics-service"
      + region               = "us-east-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "terraform-aws-ecr"
          + "Name"        = "togglemaster/analytics-service"
          + "Project"     = "ToggleMaster"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "terraform-aws-ecr"
          + "Name"        = "togglemaster/analytics-service"
          + "Project"     = "ToggleMaster"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.ecr_auth_service.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire untagged images older than 3 days"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 3
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep only last 10 tagged images"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "prod",
                              + "staging",
                              + "dev",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + region      = "us-east-1"
      + registry_id = (known after apply)
      + repository  = "togglemaster/auth-service"
    }

  # module.ecr_auth_service.aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "togglemaster/auth-service"
      + region               = "us-east-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "terraform-aws-ecr"
          + "Name"        = "togglemaster/auth-service"
          + "Project"     = "ToggleMaster"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "terraform-aws-ecr"
          + "Name"        = "togglemaster/auth-service"
          + "Project"     = "ToggleMaster"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.ecr_evaluation_service.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire untagged images older than 3 days"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 3
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep only last 10 tagged images"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "prod",
                              + "staging",
                              + "dev",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + region      = "us-east-1"
      + registry_id = (known after apply)
      + repository  = "togglemaster/evaluation-service"
    }

  # module.ecr_evaluation_service.aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "togglemaster/evaluation-service"
      + region               = "us-east-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "terraform-aws-ecr"
          + "Name"        = "togglemaster/evaluation-service"
          + "Project"     = "ToggleMaster"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "terraform-aws-ecr"
          + "Name"        = "togglemaster/evaluation-service"
          + "Project"     = "ToggleMaster"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.ecr_flag_service.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire untagged images older than 3 days"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 3
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep only last 10 tagged images"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "prod",
                              + "staging",
                              + "dev",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + region      = "us-east-1"
      + registry_id = (known after apply)
      + repository  = "togglemaster/flag-service"
    }

  # module.ecr_flag_service.aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "togglemaster/flag-service"
      + region               = "us-east-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "terraform-aws-ecr"
          + "Name"        = "togglemaster/flag-service"
          + "Project"     = "ToggleMaster"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "terraform-aws-ecr"
          + "Name"        = "togglemaster/flag-service"
          + "Project"     = "ToggleMaster"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.ecr_targeting_service.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire untagged images older than 3 days"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 3
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep only last 10 tagged images"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "prod",
                              + "staging",
                              + "dev",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + region      = "us-east-1"
      + registry_id = (known after apply)
      + repository  = "togglemaster/targeting-service"
    }

  # module.ecr_targeting_service.aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "togglemaster/targeting-service"
      + region               = "us-east-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "terraform-aws-ecr"
          + "Name"        = "togglemaster/targeting-service"
          + "Project"     = "ToggleMaster"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "terraform-aws-ecr"
          + "Name"        = "togglemaster/targeting-service"
          + "Project"     = "ToggleMaster"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.eks.data.aws_eks_cluster_auth.cluster[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster_auth" "cluster" {
      + id     = (known after apply)
      + name   = "ToggleMaster"
      + region = (known after apply)
      + token  = (sensitive value)
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "coredns"
      + addon_version               = "v1.13.2-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "ToggleMaster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = false
      + region                      = "us-east-1"
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "AddonName"                          = "coredns"
          + "Ambiente"                           = "terraform-prod"
          + "ClusterName"                        = "ToggleMaster"
          + "Environment"                        = "production"
          + "ManagedBy"                          = "Terraform"
          + "Name"                               = "ToggleMaster-coredns"
          + "kubernetes.io/cluster/ToggleMaster" = "owned"
        }
      + tags_all                    = {
          + "AddonName"                          = "coredns"
          + "Ambiente"                           = "terraform-prod"
          + "ClusterName"                        = "ToggleMaster"
          + "Environment"                        = "production"
          + "ManagedBy"                          = "Terraform"
          + "Name"                               = "ToggleMaster-coredns"
          + "kubernetes.io/cluster/ToggleMaster" = "owned"
        }

      + timeouts {
          + create = "20m"
          + delete = "40m"
          + update = "20m"
        }
    }

  # module.eks.aws_eks_addon.this["eks-pod-identity-agent"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "eks-pod-identity-agent"
      + addon_version               = "v1.3.10-eksbuild.2"
      + arn                         = (known after apply)
      + cluster_name                = "ToggleMaster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = false
      + region                      = "us-east-1"
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "AddonName"                          = "eks-pod-identity-agent"
          + "Ambiente"                           = "terraform-prod"
          + "ClusterName"                        = "ToggleMaster"
          + "Environment"                        = "production"
          + "ManagedBy"                          = "Terraform"
          + "Name"                               = "ToggleMaster-eks-pod-identity-agent"
          + "kubernetes.io/cluster/ToggleMaster" = "owned"
        }
      + tags_all                    = {
          + "AddonName"                          = "eks-pod-identity-agent"
          + "Ambiente"                           = "terraform-prod"
          + "ClusterName"                        = "ToggleMaster"
          + "Environment"                        = "production"
          + "ManagedBy"                          = "Terraform"
          + "Name"                               = "ToggleMaster-eks-pod-identity-agent"
          + "kubernetes.io/cluster/ToggleMaster" = "owned"
        }

      + timeouts {
          + create = "20m"
          + delete = "40m"
          + update = "20m"
        }
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "kube-proxy"
      + addon_version               = "v1.34.3-eksbuild.2"
      + arn                         = (known after apply)
      + cluster_name                = "ToggleMaster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = false
      + region                      = "us-east-1"
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "AddonName"                          = "kube-proxy"
          + "Ambiente"                           = "terraform-prod"
          + "ClusterName"                        = "ToggleMaster"
          + "Environment"                        = "production"
          + "ManagedBy"                          = "Terraform"
          + "Name"                               = "ToggleMaster-kube-proxy"
          + "kubernetes.io/cluster/ToggleMaster" = "owned"
        }
      + tags_all                    = {
          + "AddonName"                          = "kube-proxy"
          + "Ambiente"                           = "terraform-prod"
          + "ClusterName"                        = "ToggleMaster"
          + "Environment"                        = "production"
          + "ManagedBy"                          = "Terraform"
          + "Name"                               = "ToggleMaster-kube-proxy"
          + "kubernetes.io/cluster/ToggleMaster" = "owned"
        }

      + timeouts {
          + create = "20m"
          + delete = "40m"
          + update = "20m"
        }
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "vpc-cni"
      + addon_version               = "v1.21.1-eksbuild.3"
      + arn                         = (known after apply)
      + cluster_name                = "ToggleMaster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = false
      + region                      = "us-east-1"
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "AddonName"                          = "vpc-cni"
          + "Ambiente"                           = "terraform-prod"
          + "ClusterName"                        = "ToggleMaster"
          + "Environment"                        = "production"
          + "ManagedBy"                          = "Terraform"
          + "Name"                               = "ToggleMaster-vpc-cni"
          + "kubernetes.io/cluster/ToggleMaster" = "owned"
        }
      + tags_all                    = {
          + "AddonName"                          = "vpc-cni"
          + "Ambiente"                           = "terraform-prod"
          + "ClusterName"                        = "ToggleMaster"
          + "Environment"                        = "production"
          + "ManagedBy"                          = "Terraform"
          + "Name"                               = "ToggleMaster-vpc-cni"
          + "kubernetes.io/cluster/ToggleMaster" = "owned"
        }

      + timeouts {
          + create = "20m"
          + delete = "40m"
          + update = "20m"
        }
    }

  # module.eks.aws_eks_cluster.main[0] will be created
  + resource "aws_eks_cluster" "main" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + deletion_protection           = true
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "ToggleMaster"
      + platform_version              = (known after apply)
      + region                        = "us-east-1"
      + role_arn                      = "arn:aws:iam::852826843210:role/LabRole"
      + status                        = (known after apply)
      + tags                          = {
          + "Ambiente"                           = "terraform-prod"
          + "ClusterName"                        = "ToggleMaster"
          + "Environment"                        = "production"
          + "ManagedBy"                          = "Terraform"
          + "Name"                               = "ToggleMaster"
          + "kubernetes.io/cluster/ToggleMaster" = "owned"
        }
      + tags_all                      = {
          + "Ambiente"                           = "terraform-prod"
          + "ClusterName"                        = "ToggleMaster"
          + "Environment"                        = "production"
          + "ManagedBy"                          = "Terraform"
          + "Name"                               = "ToggleMaster"
          + "kubernetes.io/cluster/ToggleMaster" = "owned"
        }
      + version                       = "1.34"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = true
        }

      + compute_config (known after apply)

      + control_plane_scaling_config (known after apply)

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = "10.43.0.0/16"
          + service_ipv6_cidr = (known after apply)

          + elastic_load_balancing (known after apply)
        }

      + storage_config (known after apply)

      + timeouts {
          + create = "30m"
          + delete = "15m"
          + update = "60m"
        }

      + upgrade_policy {
          + support_type = "EXTENDED"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = false
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.this["ToggleMaster-prd-private-1a-01"] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = "AL2023_x86_64_STANDARD"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "ToggleMaster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + labels                 = {
          + "node.kubernetes.io/nodegroup" = "ToggleMaster-prd-private-1a-01"
        }
      + node_group_name        = "ToggleMaster-prd-private-1a-01"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::852826843210:role/LabRole"
      + region                 = "us-east-1"
      + release_version        = "1.34.3-20260209"
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Ambiente"                           = "terraform-prod"
          + "ClusterName"                        = "ToggleMaster"
          + "Environment"                        = "production"
          + "ManagedBy"                          = "Terraform"
          + "Name"                               = "ToggleMaster-ToggleMaster-prd-private-1a-01"
          + "kubernetes.io/cluster/ToggleMaster" = "owned"
        }
      + tags_all               = {
          + "Ambiente"                           = "terraform-prod"
          + "ClusterName"                        = "ToggleMaster"
          + "Environment"                        = "production"
          + "ManagedBy"                          = "Terraform"
          + "Name"                               = "ToggleMaster-ToggleMaster-prd-private-1a-01"
          + "kubernetes.io/cluster/ToggleMaster" = "owned"
        }
      + version                = "1.34"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 4
          + min_size     = 1
        }

      + timeouts {
          + create = "60m"
          + delete = "60m"
          + update = "60m"
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks.aws_eks_node_group.this["ToggleMaster-prd-private-1b-01"] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = "AL2023_x86_64_STANDARD"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "ToggleMaster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + labels                 = {
          + "node.kubernetes.io/nodegroup" = "ToggleMaster-prd-private-1b-01"
        }
      + node_group_name        = "ToggleMaster-prd-private-1b-01"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::852826843210:role/LabRole"
      + region                 = "us-east-1"
      + release_version        = "1.34.3-20260209"
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Ambiente"                           = "terraform-prod"
          + "ClusterName"                        = "ToggleMaster"
          + "Environment"                        = "production"
          + "ManagedBy"                          = "Terraform"
          + "Name"                               = "ToggleMaster-ToggleMaster-prd-private-1b-01"
          + "kubernetes.io/cluster/ToggleMaster" = "owned"
        }
      + tags_all               = {
          + "Ambiente"                           = "terraform-prod"
          + "ClusterName"                        = "ToggleMaster"
          + "Environment"                        = "production"
          + "ManagedBy"                          = "Terraform"
          + "Name"                               = "ToggleMaster-ToggleMaster-prd-private-1b-01"
          + "kubernetes.io/cluster/ToggleMaster" = "owned"
        }
      + version                = "1.34"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 4
          + min_size     = 1
        }

      + timeouts {
          + create = "60m"
          + delete = "60m"
          + update = "60m"
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks.aws_launch_template.eks_workers[0] will be created
  + resource "aws_launch_template" "eks_workers" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Launch template for ToggleMaster EKS nodes"
      + ebs_optimized          = "true"
      + id                     = (known after apply)
      + instance_type          = "t3.medium"
      + latest_version         = (known after apply)
      + name                   = "lt-togglemaster-prod"
      + name_prefix            = (known after apply)
      + region                 = "us-east-1"
      + tags                   = {
          + "Ambiente"                           = "terraform-prod"
          + "ClusterName"                        = "ToggleMaster"
          + "Environment"                        = "production"
          + "ManagedBy"                          = "Terraform"
          + "Name"                               = "lt-togglemaster-prod"
          + "kubernetes.io/cluster/ToggleMaster" = "owned"
        }
      + tags_all               = {
          + "Ambiente"                           = "terraform-prod"
          + "ClusterName"                        = "ToggleMaster"
          + "Environment"                        = "production"
          + "ManagedBy"                          = "Terraform"
          + "Name"                               = "lt-togglemaster-prod"
          + "kubernetes.io/cluster/ToggleMaster" = "owned"
        }
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination      = "true"
              + encrypted                  = "true"
              + iops                       = 3000
              + throughput                 = 125
              + volume_initialization_rate = (known after apply)
              + volume_size                = 60
              + volume_type                = "gp3"
            }
        }



... (truncado — ver logs do CI para output completo)
```
</details>

_Commit: `8f746168e737b10cff3edad37fcefb134e29d9ee`_